#### BRepBuilderOutcome Enumeration

---

|  |
| --- |
| See Also |

This class defines possible outcomes returned by BRepBuilder functions that need to report outcome via a return value.

This enumerated type corresponds to possible outcomes returned by BRepBuilder functions.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public enum BRepBuilderOutcome ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration BRepBuilderOutcome ``` |

| Visual C++ |
| --- |
| ``` public enum class BRepBuilderOutcome ``` |

# Members

| Member name | Description |
| --- | --- |
| Success | The function has completed successfully. |
| Failure | Unspecified failure. BRepBuilder object is in invalid state and should not be used. |

# See Also

Autodesk.Revit.DB Namespace